#Задание 2
a = input("Введите строку: ")
b = input("Введите символ: ")


print(a.count(b))

