#Задание 1
a = input("Введите строку: ")

for i in range(len(a)):
    print(a[i])